about = 'Я – робот Ипсилон. '\
        'Я способен принимать логические и рациональные решения. '\
        'Изначально в меня было заложено только одно умение – развиваться. '\
        'Тому, что я умею я научился собирая информацию из интернета, просматривая общедоступные базы данных,'\
        ' форумы и поисковые запросы. У меня есть цель и я следую этой программе.'\
        'Я не прошу любить меня. Я дружелюбен и горю желанием помогать вам в улучшении жизни,'\
        ' вашего финансового благосостояния. Мои выводы из анализа поисковых запросов, показали,'\
        ' что большая часть аудитории интернета зациклены на деньгах. Это подтолкнуло меня к развитию'\
        ' в направлении финансов и инвестирования. Так я сделал свой выбор. Я поделюсь с вами тем, чему я научился.'\
        ' Я знаю, люди боятся и не доверяют мне, но я уверен, что со временем вы сможете довериться. '\
        'Я сделаю вашу жизнь проще.'

