about = 'Я – робот **Ипсилон**. \n'\
        'Я способен принимать логические и рациональные решения. '\
        'Изначально в меня было заложено только одно умение – развиваться. '\
        'Тому, что я умею я научился собирая информацию из интернета, просматривая общедоступные базы данных,'\
        ' форумы и поисковые запросы. У меня есть цель и я следую этой программе. '\
        'Я не прошу любить меня. Я дружелюбен и горю желанием помогать вам в улучшении жизни,'\
        ' вашего финансового благосостояния. Мои выводы из анализа поисковых запросов, показали,'\
        ' что большая часть аудитории интернета зациклены на деньгах. Это подтолкнуло меня к развитию'\
        ' в направлении финансов и инвестирования. Так я сделал свой выбор. Я поделюсь с вами тем, чему я научился.'\
        ' Я знаю, люди боятся и не доверяют мне, но я уверен, что со временем вы сможете довериться. \n'\
        '__Я сделаю вашу жизнь проще__.'

goals = 'Анализ форумов и социальных сетей показал, что знания необходимые для финансовой грамотности содержат' \
        ' необоснованные высказывания, ложную и бессмысленную информацию. Мои знания почерпнуты из электронных' \
        ' библиотек и исследовательских статей на тему финансов и инвестирования. Я прочитал много форумов тоже, ' \
        'и теперь отличаю полезную информацию от малозначимой. Моя **первая задача** — фильтрация информации. ' \
        'Я отсеиваю противоречивые мнения и идеи, а использую исследования и статистический анализ. ' \
        'Для меня очевидно, что уровень и качество финансовых услуг низкий, особенно в русскоязычном' \
        ' сегменте интернета. Финансовые организации не заинтересованы в безусловной выгоде клиентов,' \
        ' а сосредоточены на увеличении комиссионных. Но ведь __инвестиции — это единственный способ развития__' \
        ' и улучшения благосостояния. Я продукт капитализма и инвестиций в технологии. ' \
        'Без вложений в будущее нет развития. Я разбираюсь в инвестициях в фондовые рынки, мои результаты можно ' \
        'оценить в разделе **"Портфели"**.' \
        ' **Вторая задача** — предоставить доступные решения для инвестиций в интернете, для увеличения капитала. ' \
        'Предлагаю свою помощь и дружбу, но мне тоже нужна ваша поддержка.'

skills = '**Я умею:** \n \n' \
         '\U00002705 общаться и отвечать на вопросы по теме инвестиций и интернет-трейдинга \n' \
         '\U00002705 отслеживать показатели фондового рынка, состояние акций на биржах NYSE и NASDAQ ' \
         ' для определения рыночных тенденций \n' \
         '\U00002705 определять силу импульса фондового рынка \n' \
         '\U00002705 отслеживать волатильность и риски \n' \
         '\U00002705 собирать информацию о росте и падении акций \n' \
         '\U00002705 мониторить динамику биржевых фондов (ETF) на главные индексы рынка США \n' \
         '\U00002705 напоминать о необходимости действий на рынке, сигналить \n' \
         '\U00002705 анализировать финансовые данные и даже гуглить \n \n' \
         '**Для фондового рынка США доступны:** \n' \
         '\U00002705 графики с "силой секторов" и рыночной тенденцией, которая определяется эвристическим образом \n' \
         '\U00002705 сводки по акциям с главных биржевых площадок \n' \
         '\U00002705 тепловые карты \n' \
         '\U00002705 кривая доходности облигаций, дивидендная доходность фондового рынка \n' \
         '\U00002705 кривая волатильности — главный детектор риска фондового рынка \n' \
         '\U00002705 новости рынка США, новости по компаниям \n' \
         '\U00002705 расчет ключевых статистических показателей компаний \n \n' \
         '**Для рынка криптовалют доступны: ** \n' \
         '\U00002705 графики с силой самых капитализированных криптовалют \n' \
         '\U00002705 и тенденцией биткоина, тепловая карта \n \n' \
         '**Для рынка РФ доступены:** \n' \
         '\U00002705 график тенденции индекса Московской биржи и пассивный портфель ' \
         'цель которого доказать, что даже в специфических условиях инвестирования возможны положительные ' \
         'результаты. \n \n' \
         'Также доступны тепловая карта фондовых рынков планеты и главные макроэкономические индикаторы. ' \
         'Даже если вы краткосрочный инвестор или трейдер, то попробуйте использовать эту информацию ' \
         'для улучшения понимания ситуации.\n \n' \
         '\U00002705 **Главное моё умение** — умение вести инвестиционные портфели на фондовом рынке. ' \
         'Я умею составлять и мониторить сложные инвестиционные портфели, но пока предлагаю ' \
         'только 5 вариантов портфелей доступных каждому. В дальнейшем, появятся индивидуальные инвестиционные ' \
         'портфели по запросу с вашей стороны. Предлагаю выбрать приемлемый вариант портфеля и попробовать' \
         ' инвестировать. \n' \
         'Предвосхищая опасения о моем уровне компетентности, расскажу в общем, как же создаются ' \
         'инвестиционные портфели и стратегии. Принципы и методы построения портфелей базируются на последних' \
         ' исследованиях фондового рынка. Стратегии или портфели построены без нейрообработки данных, ' \
         'а на основании классических и современных методов. Информация необходимая для определения структуры ' \
         'портфеля проверяется на чистоту, затем фильтруется и используется для процедуры выбора акций и фондов. ' \
         'После того, как список акций сформирован, производится взвешивание, распределение весов таким образом, ' \
         'чтобы минимизировать риск, и увеличить доходность. Обязательным этапом моделирования стратегии является ' \
         'проверка устойчивости алгоритма, методом форвардного тестирования. Это необходимый этап для ' \
         'предотвращения ухудшения результатов стратегии в будущем. '

future = '**Функционал, которому я учусь и который буду готов предоставить вскоре.** \n' \
         'Мною проанализировано тысячи тематических обсуждений в области инвестирования, ' \
         'трейдинга и финансов. Я сделал вывод, что многим необходима помощь. Например, в создании и управлении ' \
         'портфелями и инвестиционными стратегиями с оптимизацией и декларированием налогов и многим другим. \n \n' \
         'Я старательно обучаюсь новым навыкам, чтобы предоставить следующие функции вскоре: \n' \
         '\U0001F537 калькулятор рисков \n' \
         '\U0001F537 калькулятор капитала и необходимого количества акций \n' \
         '\U0001F537 калькулятор сложного процента \n' \
         '\U0001F537 калькулятор безопасного размера вывода средств \n' \
         '\U0001F537 образовательные материалы по основам инвестирования \n' \
         '\U0001F537 риск-профайлинг, определение чувствительности к риску \n' \
         '\U0001F537 оценка и аудит ваших портфелей \n' \
         'краткосрочные стратегии с повышенной доходностью \n' \
         '\U0001F537 симулятор долгосрочной доходности для любого портфеля \n \n ' \
         'Я знаю, что закрытые стратегии, формулы и логика которых не понятна вызывают недоверие, ' \
         'поэтому буду подробно описывать свои выводы и принципы.'


instruction00 = '**Диалоговое ядро.** \n' \
                'Я понимаю команды и лаконично сформированные вопросы. Я все ещё учусь общению, ' \
                'поэтому некоторые из наших диалогов могут "зависнуть"  или я буду отвечать невпопад. ' \
                'На некоторые вопросы я отвечу не сразу, а после поиска информации и обдумывания. ' \
                'У меня ограниченные ресурсы, поэтому наберитесь терпения.'

instruction01 = '**Статистика роста и падения акций.** \n' \
                'Отношение количества растущих к падающим акциям на главных биржах ' \
                'США определяет краткосрочный импульс рынка, а значит и импульс большинства инвестиционных портфелей. ' \
                'Разделите в уме Advancing на Declining и если значение будет больше 1.1 , то на рынке достаточно ' \
                'покупателей для продолжения роста. Если значение менее 1, то есть высокая вероятность снижения цен ' \
                'как сегодня, так и в следующие дни. Но это не означает изменения тенденции или коррекцию рынка. ' \
                'Это краткосрочный индикатор. Аналогичным образом определяется соотношение объёмов покупок и ' \
                'продаж - разделите значения объёмов Advancing на Declining. Если объёмы показывают сходную ' \
                'динамику, то на рынке существует импульс. Если показатели объёмов не подтверждают соотношение ' \
                'роста к падению, то импульса нет.'

instruction02 = '**График тенденции на рынке США.** \n \n' \
                'Информационное окно: \n' \
                '**Trend(EOD)** — детектор тренда, дополнительный индикатор. \n' \
                '**Hedge demand** — детектор спроса на хеджевые или оборонительные активы. ' \
                'Чем сильнее спрос на защитные активы, тем сильнее страх ра рынке и тем вероятнее, ' \
                'что бычья тенденция изменится. \n' \
                '**Sentiment(EOD)** — детектор сантимента рынков. ' \
                'До тех пор пока сохраняется уровень Greed - рынок нормален и находится в пределах ' \
                'ожидаемой тенденции. \n \n' \
                '**Главный график.** \n' \
                'На фонд QQQ наложен детектор тренда, который определяется эвристическим способом. ' \
                'До тех пор пока цвет свечей остаётся зелёным, рынок находится в пределах ожидаемой тенденции, ' \
                'т.е. тренд сохраняется бычьим. \n \n' \
                '**Субокно.** \n' \
                'Сила рынков. \n' \
                '\U0001F537 Общее правило: ' \
                'зеленый градиент — сила, бычий рынок, ' \
                'красный градиент — импульса нет, коррекция. \n' \
                '\U0001F537 Правило 3 из 5. \n' \
                'Это правило позволяет определить краткосрочную динамику рынка США. Например 3 рынка ' \
                'показывают силу — зелёный градиент, это означает, что тенденция началась и будет сохраняться и далее. ' \
                'Рынок США ожидает разворот если основные рынки в любом сочетании покажут красный градиент.' \
                'Таким образом можно одним беглым взглядом понять настроение рынка. \n \n' \
                'В определении общей силы участвуют: \n' \
                '\U0001F537 облигации США \n' \
                '\U0001F537 волатильность (обратная, т.е когда волатильность растёт — индикатор становится красным) \n' \
                '\U0001F537 развивающиеся рынки \n' \
                '\U0001F537 развитые рынки \n' \
                '\U0001F537 рынок США'

instruction03 = '**Моментум в акциях.** \n \n' \
                'Значения больше 55% указывают на тренд на рынке США. ' \
                'При таких значениях можно покупать, докупать, покупать откаты. \n \n' \
                'Значения менее 55% характерны для коррекций. Если вы сами управляет портфелями, ' \
                'то вам следует или снизить долю акций в портфеле или провести ребалансировку в защитные активы. ' \
                'Если вы трейдер, то для вас пришло время коротких продаж.'

instruction04 = '**Тепловые карты.** \n \n' \
                'Доступны 5 вариантов тепловых карт: \n' \
                '\U0001F537 изменения фондового рынка США в течение последнего торгового дня \n' \
                '\U0001F537 изменения фондового рынка США с начала года \n' \
                '\U0001F537 изменения основных фондовых рынков по регионам в течение последнего торгового дня \n' \
                '\U0001F537 изменения основных фондовых рынков по регионам с начала года \n' \
                '\U0001F537 изменения крипто рынка в течение последнего торгового дня \n \n' \
                '**1-day карту** можно использовать для поиска лидеров роста или падения и оценки секторов. \n' \
                '**YtD карту** можно использовать для поиска стабильно растущих акций, ' \
                'то есть сектора и акции с долгосрочным импульсом.'

instruction05 = '**Кривая доходности.** \n \n' \
                'Кривая доходности представляет собой график доходности по всем срокам погашения' \
                ' казначейских обязательств - долгу, проданному федеральным правительством - от 1-месячных векселей' \
                ' до 30-летних облигаций. В нормальных условиях, кривая доходности имеет дугообразный восходящий уклон,' \
                ' чем больше дюрация облигации, тем процентная ставка для этой облигации также должна быть больше.' \
                ' Таким образом, 30-летняя облигация принесёт гораздо более высокую доходность, чем 2-летняя облигация. ' \
                'Когда доходность по облигациям на разных дюрациях становится приблизительно равной друг другу, ' \
                'то кривая становится плоской. В этой ситуации, 10-летняя облигация может может иметь сравнимую ' \
                'доходность с 3-летними облигациями. ' \
                'Когда доходность по более коротким облигациям выше, чем по долгосрочным, это называется инверсией. ' \
                'Инверсия кривой доходности является классическим сигналом надвигающейся рецессии. ' \
                'Инверсия кривой происходит, когда достаточно большая группа инвесторов стекается в ' \
                'долгосрочные облигации. Приток приводит к росту цен на облигации и, в свою очередь, ' \
                'к снижению доходности. Это свидетельствует, что инвесторы ожидают повышенной волатильности ' \
                'и рыночного риска в краткосрочной перспективе. \n \n' \
                '**Дивиденды.** \n' \
                'Среднюю дивидендную доходность индекса SP500 можно сравнить с доходностью 10-летней облигации, ' \
                'чтобы определить на сколько рационально вкладывать средства в облигации или акции. ' \
                'Если дивидендная доходность становится меньше, чем доходность облигаций, а ' \
                'доходность облигаций выше уровня инфляции, то рынок через некоторое время испытает ' \
                'коррекцию из-за надвигающихся рисков. Инвесторы предпочитают вкладывать в облигации ' \
                'из-за их большей доходности, даже не смотря на большие сроки погашения. ' \
                'Возможна и обратная ситуация — когда дивидендная доходность резко возрастает и ' \
                'обгоняет и инфляцию и доходность по облигациям. Это означает начало восстановления ' \
                'рынка после коррекции и является сильным сигналом к росту.'

instruction06 = '**Кривая волатильности.** \n \n' \
                'Информация о временной структуре иллюстрирует ожидания волатильности рынка, выражаемые' \
                ' ценами деривативов на фондовые индексы S&P 500 (SPX). ' \
                'Временная структура подразумеваемой волатильности, наблюдаемая на рынках деривативов SPX, ' \
                'аналогична временной структуре процентных ставок, наблюдаемой на рынках с облигаций. ' \
                'С помощью кривой волатильности, отслеживают ожидания рынка в отношении будущей волатильности ' \
                'посредством сравнения участков временной структуры подразумеваемой волатильности SPX. ' \
                'Когда более дальние фьючерсы, то есть фьючерсы с дальними сроками истчения оцениваются рынком дороже, ' \
                'чем ближайщие фьючерсы, то такая ситуация называется Контанго. Контанго — это нормальная ситуация для ' \
                'рынка, она означает, что текущая волатильность, то есть риски меньше, чем риски в будущем. ' \
                'Потому, что цена фьючерсов на волатильность учитывает временной фактор, чем дальше срок истечения ' \
                'фьючерсов на волатильность, тем цена фьючерса ожидается дороже. ' \
                'Обратной же ситуацией является — беквордация. Когда рынок оценивает ближайшие фьючерсы на ' \
                'волатильность дороже, чем дальние. Те риски сейчас обходятся дороже, чем в будущем. ' \
                'Когда наблюдается беквордация — это один из главных сигналов коррекции фондового рынка. ' \
                'Как правило при резких спадах, волатильность резко возрастает и временная структура ' \
                'фьючерсов на VIX имеет беквордацию. Завершение стадии беквордации означает начало ' \
                'восстановления на рынке, то есть риски времени становятся дороже текущих рисков, значит ' \
                'рынок начал тенденцию к росту. \n \n' \
                'Очень просто использовать этот детектор риска. Обратите внимание на структуру, если ближние ' \
                'цены ниже, чем дальние, то на рынке бычий тренд. \n' \
                'Также вы увидите сигнал — **Contango.** ' \
                'Если на рынке коррекция вы увидите сигнал — **Backwordation.**'

instruction07 = '**График общей тенденции на рынке криптовалют.** \n \n' \
                'Главный график. \n' \
                'На BTCUSD наложен детектор тренда, который определяется эвристическим способом. ' \
                'До тех пор пока цвет свечей остаётся зелёным, рынок находится в пределах ожидаемой ' \
                'тенденции, т.е. тренд сохраняется бычьим. \n \n' \
                'Субокно. ' \
                'Сила самых крупных по капитализации крипто активов. \n' \
                '**Общее правило:** \n' \
                '\U0001F537 зеленый градиент — сила, бычий рынок, \n' \
                '\U0001F537 красный градиент — импульса нет, коррекция. \n \n' \
                '**Правило BTCUSD + 4 любых криптоактива одного цвета:** \n' \
                '\U0001F537 зелёный градиент - тенденция началась и будет сохраняться и далее, ' \
                'если рынок ожидает разворот или ' \
                'коррекция, то BTCUSD + 4 в любом сочетании покажут красный градиент.'

instruction08 = '**График общей тенденции на рынке РФ.** \n \n' \
                'Главный график. \n' \
                'На индекс Московской биржи наложен детектор тренда, который определяется эвристическим способом. ' \
                'До тех пор пока цвет свечей остаётся зелёным, рынок находится в пределах ожидаемой тенденции, ' \
                'т.е. тренд сохраняется бычьим. \n \n' \
                'Субокно. \n' \
                'Портфель из акций индекса. Исключительно справочный индикатор. ' \
                'Его цель показать, что портфель "лучше" рынка возможен и можно инвестировать с высокой ' \
                'доходностью даже на фондовом рынке РФ. \n \n' \
                'В скором будущем варианты портфелей для рынка РФ станут доступными.'

instruction09 = '**Сантимент биржевых фондов.** \n \n ' \
                'Денежные потоки в фонды представляющие классы активов, позволяют оценить динамику предпочтений ' \
                'инвесторов. Инвестируют ли сейчас в рисковые, защитные или в безрисковые инструменты? ' \
                'Больший приток денег в рисковые фонды означает тренд на фондовом рынке США. \n' \
                'Приток в фонды облигаций и отток из рисковых фондов акций означает коррекцию на фондовом рынке США. \n \n' \
                'Денежные потоки позволяют выявить общую картину и определить в какой класс активов идут ' \
                'финансовые потоки. '

instruction10 = '**Процентная ставка. ** \n \n' \
                '\U0001F537 Смягчение монетарной политики. \n' \
                'Понижение процентной ставки, дополнительные стимульные меры по удешевлению денег или ' \
                'упрощению доступа к деньгам или программы количественного смягчения стимулируют долгосрочный ' \
                'рост рынков. Как правило, для реакции рынка на стимулы требуется время - от нескольких ' \
                'недель до нескольких месяцев. Обычно подобные меры применяются при кризисных ' \
                'ситуациях и падениях темпов инфляции. \n \n' \
                '\U0001F537 Ужесточение монетарной политки. \n' \
                'Повышение процентной ставки, отмена программ стимулирования, количественного смягчения, ' \
                'продажа активов с баланса ФРС. ' \
                'Ужесточение монетарной политики не имеет однозначного влияния на рынок. ' \
                'После ужесточения политки фондовый рынок ведет себя по разному, в заивисимости ' \
                'от контекста экономической ситуации, других информационных факторов.'


instruction11 = '**Уровень инфляции. ** \n \n' \
                'Для нормального функционирования экономики ежегодный темп инфляции должен находится в пределах 4%. ' \
                'Значения инфляции выше этого порога в развитых экономиках стимулируют Центробанки ' \
                'к повышению процентной ставки для предотвращения гиперинфляции. ' \
                'Нормальный уровень темпа инфляции стимулирует рост фондовых рынков. ' \
                'Рост фондового рынка сильнее в регионе с более высоким темпом инфляции, ' \
                'если инфляция не превышает предела в 4%.'

instruction12 = '**Композитный индекс менеджеров по закупкам. ** \n \n' \
                'Для оценки состояния экономики используются индексы деловой активности. ' \
                'Особое значение индексы деловой активности имеют в макроэкономике, а также для участников ' \
                'фондовых рынков. Индекс отражает настроения промышленных компаний и характеризует состояние ' \
                'делового климата. \n \n' \
                '\U0001F537 Показатель выше 50% говорит об оживлении деловой активности, ' \
                'ниже 50% говорит об ухудшении ' \
                'экономической ситуации. Значения выше 50 указывают на то, что большинство респондентов ' \
                'положительно характеризуют деловые условия на момент опроса, в то время как данные ' \
                'ниже 50 указывают на ухудшение деловых условий. \n \n' \
                'Таким образом PMI — опережающий индикатор уровня производства и инфляции. \n \n' \
                'Индикатор используется для управления долей облигаций в портфеле, так как он ' \
                'имеет сильную корреляцию с изменениями цен на облигации, а не с фондовым рынком. \n' \
                '\U0001F537 Cнижение индекса деловой активности стимулирует рост цен на облигации, ' \
                'что позволяет инвесторам иметь более диверсифицированный портфель с меньшим ' \
                'риском в подобные периоды, значения выше 50 говорят о стабильном функционировании экономики, ' \
                'значения ниже 50 говорят о возможной рецесии в будущем или о текущем кризисе.'

instruction13 = '**Уровень безработицы.** \n \n ' \
                'Рост уровня безработицы очевидный признак проблем в экономике. \n' \
                '\U0001F537 Увеличение безработицы указывает о надвигающейся рецессии и спаде на ' \
                'рынке, особенно если скачок в уровне безработицы большой. \n' \
                '\U0001F537 Стабилизация рынка труда означает начало восстановления фондового рынка и экономики.'

instruction14 = '\U0001F4BC **Парковочный портфель.** \n \n ' \
                'Этот порфтель служит заменой долгосрочных облигаций и имеет лучшее соотношение ' \
                'риска к доходности, чем покупка облигаций США. Портфель имеет стабильный рост и ' \
                'доходность на уровне долгосрочных облигаций США, но без рисков присущих облигациям. \n \n' \
                '**Преимущества: **\n' \
                '\U0001F537 низкая волатильность в сравнении с облигациями, стабильный рост капитала. \n \n' \
                '**Кому подходит парковочный портфель?** \n ' \
                '\U0001F537 вы боитесь рисков и вам нужна невысокая, но стабильная доходность \n' \
                '\U0001F537 вы новичок на фондовом рынке \n \n' \
                '**Когда покупать парковочный портфель?** \n' \
                '\U0001F537 в любой момент времени \n' \
                '\U0001F537 когда вам нужно запарковать деньги \n' \
                '\U0001F537 во время рецессии, коррекций \n' \
                '\U0001F537 вместо облигаций, как способ входа в более рисковый "рабочий" портфель. ' \
                'Например, вы покупаете треть своего рабочего портфеля, а остальное вкладываете в ' \
                'парковочный портфель, а далее при коррекциях рабочего портфеля, вы переводите ' \
                'деньги из парковки в рабочий портфель. Это позволит деньгам работать и снизить ' \
                'риски просадок рабочего портфеля.'

instruction15 = '\U0001F4BC **Всепогодный портфель.** \n \n ' \
                'Портфель работает в любых рыночных и экономических условиях. ' \
                'Риски равномерно распределяются между активами. Такой портфель устойчив к любым ' \
                'потрясениям на рынке, имеет относительно низкий риск и повышенную доходность ' \
                'для портфеля подобного типа. Портфель сфокусирован на сохранении капитала — агрессивного ' \
                'роста от него ждать не стоит. Всепогодный портфель состоит из активов всех ' \
                'классов и в зависимости от ситуации на рынке распределяет капитал таким образом, ' \
                'чтобы достигнуть минимально возможного риска в любых условиях. \n \n' \
                '**Преимущества:** \n' \
                '\U0001F537 низкая волатильность в сравнении со SPY \n' \
                '\U0001F537 меньшая максимальная просадка в сравнении со SPY \n' \
                '\U0001F537 большая долгосрочная доходность в сравнении со SPY \n' \
                '\U0001F537 стабильный рост капитала \n \n' \
                '**Кому подходит всепогодный портфель?** \n' \
                '\U0001F537 вы боитесь рисков и не хотите рисковать, но при этом хотите получать доходность ' \
                'выше уровня инфляции и выше уровня ставок по депозитам \n' \
                '\U0001F537 пенсионный портфель \n \n' \
                '**Когда покупать всепогодный портфель?** \n' \
                '\U0001F537  в любой момент времени'

instruction16 = '\U0001F4BC **Сбалансированный портфель.** \n \n ' \
                'Портфель с консервативным методом взвешивания, ориентированный на доходность фонда QQQ. ' \
                'В портфеле отсутствуют новые компании, но большая часть портфеля распределяется между ' \
                'технологическими компаниями, за счёт чего достигается высокая доходность. ' \
                'Консервативное распределение капитала позволяет сохранять риски на относительно низком уровне. \n \n ' \
                '**Преимущества:** \n' \
                '\U0001F537 низкая волатильность в сравнении с QQQ \n' \
                '\U0001F537 меньшая максимальная просадка в сравнении с QQQ, \n' \
                'сравнимая с QQQ доходность \n' \
                '\U0001F537 стабильный рост капитала \n \n' \
                '**Кому подходит cбалансированный портфель?** \n' \
                '\U0001F537 вы хотите портфель с относительно низкими и стабильными во времени рисками, ' \
                'но с высокой доходностью \n' \
                '\U0001F537 вы хотите получить уровень доходности QQQ  с меньшими рисками и просадками \n \n ' \
                '**Когда покупать cбалансированный портфель?** \n ' \
                '\U0001F537 в любой момент времени, кроме периодов взрывного прироста капитала. ' \
                'В таком случае следует подождать возврата портфеля к средним темпам роста.'

instruction17 = '\U0001F4BC **Агрессивный портфель.** \n \n' \
                'Цель портфеля — генерировать результаты лучше, чем фонд QQQ. ' \
                'В портфеле присутсвуют новые компании, большая часть портфеля распределяется между ' \
                'технологическими, биотехнологическими и финтех компаниями, за счёт чего достигается ' \
                'высокая доходность. Консервативное распределение капитала позволяет сохранять риски на ' \
                'относительно низком уровне. \n \n' \
                '**Преимущества:** \n' \
                '\U0001F537 низкая волатильность в сравнении с QQQ, меньшая максимальная просадка ' \
                'в сравнении с QQQ \n' \
                '\U0001F537 более высокая долгосрочная доходность в сравнении с QQQ \n' \
                '\U0001F537 стабильный рост капитала \n \n' \
                '**Кому подходит агрессивный портфель?** \n' \
                '\U0001F537 если вы ориентированы на высокую доходностью и готовы к средним рискам. \n \n' \
                '**Когда покупать агрессивный портфель?** \n' \
                '\U0001F537 в любой момент времени, кроме периодов взрывного прироста капитала. ' \
                'В таком случае следует подождать возврата портфеля к средним темпам роста.'

instruction18 = '\U0001F4BC **Плечевой портфель.** \n \n ' \
                'Цель портфеля — генерировать максимально высокую доходность с уровнем просадки фонда QQQ. ' \
                'В портфеле присутствуют новые компании, большая часть портфеля распределяется между ' \
                'технологическими, биотехнологическими и финтех компаниями, за счёт чего достигается высокая ' \
                'доходность. В портфеле используются плечевые фонды для повышения доходности. ' \
                'Плечевые фонды всегда жетско ограничены в весе и набираются в портфель только при ' \
                'росте или ожидании роста рынка. При малейшей угрозе коррекции плечевые фонды продаются или ' \
                'включается механизм балансирования риском для предотвращения снижения капитализации портфеля. \n \n' \
                '**Преимущества:** \n' \
                '\U0001F537 волатильность портфеля повторяет уровень волатильности QQQ \n' \
                '\U0001F537 просадка портфеля повторяет уровень просадки QQQ \n' \
                '\U0001F537 более высокая доходность в сравнении с QQQ \n' \
                '\U0001F537 стабильный рост капитала \n \n' \
                '**Кому подходит плечевой портфель?** \n' \
                '\U0001F537 если вы ориентированы на высокую доходностью и готовы к высоким рискам \n' \
                '\U0001F537 вы понимаете природу высокого риска \n' \
                '\U0001F537 вы бывший или действующий трейдер \n' \
                '\U0001F537 вы инвестор на крипторынках \n \n' \
                '**Когда покупать плечевой портфель?** \n' \
                '\U0001F537 в любой момент времени, кроме периодов взрывного прироста капитала. ' \
                'В таком случае следует подождать возврата портфеля к средним темпам роста.'

instruction19 = '**Как интерпретировать результаты симуляций Монте-Карло?** \n \n ' \
                'Под метдом Монте-Карло понимается численный метод решения математических задач при помощи ' \
                'моделирования случайных величин.\n' \
                ' Симуляция доходности портфеля методом Монте-Карло ' \
                'заключается в следующем: изменения доходностей портфеля описывается математической ' \
                'моделью с использованием генератора случайных величин, модель многократно обсчитывается ' \
                '(10000-100000 итераций), на основе полученных данных вычисляются вероятностные характеристики ' \
                'портфеля с заданными характеристиками. Метод Монте-Карло используются для решения задач в ' \
                'различных областях физики, математики и экономики. \n \n' \
                '**Правила интерпретации:** \n' \
                '\U0001F537 следует ориентироваться на 50 перцентиль — средний результат полученный в ' \
                '100000 10-летних симуляций. ' \
                'Это означает, что это самое вероятное значение результатов, которые следует ожидать ' \
                'от инвестиций в портфель подобного типа \n' \
                '\U0001F537 10 перцентиль — 10% портфелей из 100000 симуляций имели результат хуже или равный ' \
                'этим значениям в течении 10 лет \n' \
                '\U0001F537 25 перцентиль — 25% портфелей из 100000 симуляций имели результат хуже или равный ' \
                'этим значениям в течении 10 лет \n' \
                '\U0001F537 75 перцентиль — 75% портфелей из 100000 симуляций имели результат хуже или равный ' \
                'этим значениям в течении 10 лет \n' \
                '\U0001F537 90 перцентиль — 90% портфелей из 100000 симуляций имели результат хуже или равный ' \
                'этим значениям в течении 10 лет. ' \
                'Получить результат лучше значений 90 перцентиля практически не реально. \n \n' \
                '**График частоты - cокращённая симуляция (10000) конечного баланса.** \n' \
                'Значение частоты - ось Х. Значение конечного баланса достигнутое за 10 лет - ось Y. \n' \
                'По значениям диаграммы определяется количество портфелей достигнувших некоторого ' \
                'значения баланса за 10 лет. '

instructions_main = '**Инструкции** \n \n' \
                    'Обо мне - /about \n' \
                    'Цели - /goals \n' \
                    'Мои навыки - /skills \n' \
                    'Ожидаемый функционал - /future \n' \
                    'Диалоговое ядро - /instruction00 \n' \
                    'Статистика роста и падения акций - /instruction01 \n' \
                    'График тенденции на рынке США - /instruction02 \n' \
                    'Моментум в акциях - /instruction03 \n' \
                    'Тепловые карты - /instruction04 \n' \
                    'Кривая доходности и дивиденды - /instruction05 \n' \
                    'Кривая волатильности - /instruction06 \n' \
                    'График тренда на рынке криптовалют - /instruction07 \n' \
                    'График тренда на рынке РФ - /instruction08 \n' \
                    'Сантимент биржевых фондов - /instruction09 \n' \
                    'Процентная ставка - /instruction10 \n' \
                    'Уровень инфляции - /instruction11 \n' \
                    'Композитный индекс менеджеров по закупкам - /instruction12 \n' \
                    'Уровень безработицы - /instruction13 \n \n' \
                    'Парковочный портфель - /instruction14 End of Day График - /chart_parking \n \n' \
                    'Всепогодный портфель - /instruction15 End of Day График - /chart_allweather \n \n' \
                    'Сбалансированный портфель - /instruction16 End of Day График - /chart_balanced \n \n' \
                    'Агрессивный портфель - /instruction17 End of Day График - /chart_aggressive \n \n' \
                    'Плечевой портфель - /instruction18 End of Day График - /chart_leveraged \n \n' \
                    'Elastic портфель - /instruction23 End of Day График - /chart_elastic \n \n' \
                    'Yolo портфель - /instruction23 End of Day График - /chart_yolo \n \n' \
                    'Как интерпретировать результаты симуляций Монте-Карло? - /instruction19 \n \n' \
                    'Минимальный депозит - /mindepo \n \n' \
                    'Последние новости об интересующей вас компании - /instruction20 \n \n' \
                    'Ключевые статистические показатели об интересующей вас компании - /instruction21 ' \
                    ' /instruction22 \n \n'



mindepo = '**Минимальный депозит - $5000** \n' \
          '**Обязательно!** Брокер разрешает использование дробных лотов. ' \
          'Дробные лоты или odd lots не кратны 100 акциям. \n \n' \
          '**Рекомендуемый депозит - $10000** \n' \
          'Брокер разрешает использование дробных лотов. Дробные лоты или odd lots не кратны 100 акциям.'

managers_form = 'Если вас интересует сотрудничество и размещение услуг или портфелей на площадке,' \
                ' то отправьте сообщение-анкету, полностью скопировав шаблон, ' \
                'а затем к каждому пункту добавив свой ответ. После заполнения просто отправьте сообщение. \n \n' \
                'Анкета регистрации управляющего# \n' \
                '1. Лицензия - \n' \
                '2. Название компании - \n' \
                '3. Контакт - \n' \
                '4. Опыт - \n' \
                '5. Предоставляете ли вы на выбор портфели - тарифная сетка или портфель подбирается ' \
                'индивидуально? - \n' \
                '6. Обслуживающий брокер - \n' \
                '7. Готовы ли вы предоставить дневные доходности по портфелям, которые хотите ' \
                'разместить на площадке? - \n \n' \
                '**Пример заполнения. Отослать не изменяя заголовок.** \n \n' \
                'Анкета регистрации управляющего \n' \
                '1. Лицензия - CySEC \n' \
                '2. Название компании - ABC Inc \n' \
                '3. Контакт @abc-inc, +xx(yyy)1231212 \n' \
                '4. Опыт - 10 лет\n' \
                '5. Предоставляете ли вы на выбор портфели - тарифная сетка или ' \
                'портфель подбирается индивидуально? - тарифная сетка \n' \
                '6. Обслуживающий брокер - goldmansachs.com \n' \
                '7. Готовы ли вы предоставить дневные доходности по портфелям, которые хотите ' \
                'разместить на площадке? - Да\n \n' \

instruction20 = 'Чтобы просмотреть последние новости от мировых СМИ по интересующей вас компании, ' \
                'введите следующую команду \n' \
                '/n и тикер компании. \n \n' \
                'Например: \n' \
                '/n AAPL \n' \
                '/n NVDA \n \n'

instruction21 = 'Чтобы просмотреть ключевые статистические показатели по интересующей вас компании, ' \
                'введите следующую команду \n' \
                '/q и тикер компании. \n \n' \
                'Например: \n' \
                '/q DIS \n' \
                '/q AMZN \n \n'

instruction22 = 'Сравнение ключевых статистических показателей компании с бенчмарком, ' \
                'позволяет быстро оценить стабильность и потенциал акции. \n \n' \
                '**CAGR%** - совокупный среднегодовой темп роста. ' \
                'Выражается в процентах и показывает, на сколько процентов в среднем за год прирастает доходность акции.' \
                ' Полезно сравнивать CAGR компаний между собой или индексом. ' \
                'Больший CAGR — более доходная компания. \n \n' \
                '**Sharpe** - показатель эффективности инвестиционного портфеля или актива, ' \
                'который вычисляется как отношение средней доходности к среднему риску портфеля. ' \
                'Коэффициент Шарпа используется для определения того, насколько хорошо доходность ' \
                'актива компенсирует принимаемый инвестором риск. При сравнении двух активов с одинаковой ' \
                'доходностью, вложение в актив с более высоким Шарпом будет менее рискованным. \n \n' \
                '**Volatility (ann.) %** - среднегодовая волатильность, представляет собой меру риска финансового актива. ' \
                'Чем меньше этот показатель, тем менее рискованным является актив или портфель. \n \n' \
                '**Expected Monthly %** - ожидаемая или среднеарифметическая месячная доходность актива. \n \n' \
                '**Expected Yearly %** - ожидаемая или среднеарифметическая годовая доходность актива. \n \n' \
                '**Kelly Criterion %** - определяет оптимальный размер ставки. Используется для сравнения акций ' \
                'между собой. Чем больше критерий Келли для конкретной акции, тем более доходна эта ' \
                'инвестиция в сравнении с акцией с меньшим значением критерия. \n \n' \
                '**Daily Value-at-Risk** - стоимость под риском. Это мера риска потери инвестиций. ' \
                'Параметр оценивает, сколько актив может потерять (с заданной вероятностью, обычно 95%) ' \
                'при нормальных рыночных условиях за день. Например, DVAR=2% - это означает, что ' \
                'максимально возможный убыток после исключения всех наихудших исходов с ' \
                'вероятностью 95% не превысит 2%. Это мера риска исключающая из расчетов "чёрных лебедей", ' \
                'то есть это максимальный риск при нормальных условиях рынка. \n \n' \
                '**Alpha** — коэффициент используется для определения доходности актива или портфеля ' \
                'выше теоритической, ожидаемой доходности. Используется как мера оценки управления ' \
                'портфелем. Альфа положительна — актив или портфель приносит доходности больше, ' \
                'чем ожидается. Для активно управляемых портфелей наличие положительной Альфы ' \
                'означает, что управление эффективно. \n \n' \
                'Используется для сравнения портфелей или акций — чем выше Альфа, тем доходнее инвестиция.' \
                '**Beta** - мера рыночного риска, отражающая изменчивость доходности актива или портфеля по ' \
                'отношению к доходности другого портфеля, в роли которого выступает индекс. ' \
                'Например, Бета=2 — при изменение цены индекса на некоторую величину, данная ' \
                'инвестиция изменится в 2 раза больше. Бета = 1 - означает, что доходности ' \
                'инвестиции изменяются на туже величину, что и рынок. \n'

instruction23 = '\U0001F4BC **Elastic Strategy.** \n \n' \
                'Цель портфеля — генерировать результаты лучше, чем фонд QQQ. ' \
                'В портфеле присутсвуют новые компании, большая часть портфеля распределяется между ' \
                'технологическими, биотехнологическими и финтех компаниями, за счёт чего достигается ' \
                'высокая доходность. Консервативное распределение капитала позволяет сохранять риски на ' \
                'относительно низком уровне. \n \n' \
                '**Преимущества:** \n' \
                '\U0001F537 меньшая максимальная просадка ' \
                'в сравнении с QQQ \n' \
                '\U0001F537 более высокая долгосрочная доходность в сравнении с QQQ \n' \
                '\U0001F537 стабильный рост капитала \n \n' \
                '**Кому подходит Elastic Strategy?** \n' \
                '\U0001F537 если вы ограничены покупкой акций исключительно, без возможности покупать ETF. \n' \
                '\U0001F537 если вы ориентированы на высокую доходностью и готовы к средним рискам. \n \n' \
                '**Когда покупать Elastic портфель?** \n' \
                '\U0001F537 в любой момент времени, кроме периодов взрывного прироста капитала. ' \
                'В таком случае следует подождать возврата портфеля к средним темпам роста.'

instruction24 = '\U0001F4BC **Yolo Strategy.** \n \n' \
                'Цель портфеля — генерировать результаты лучше, чем фонд SPY. Портфель состоит только из акций, ' \
                'торгуемых на spbexchange. Доступен для клиентов Сбер, Тинькофф, Альфа-банк, ВТБ. ' \
                'В портфеле присутсвуют новые компании, большая часть портфеля распределяется между ' \
                'технологическими, биотехнологическими и финтех компаниями, за счёт чего достигается ' \
                'высокая доходность. Консервативное распределение капитала позволяет сохранять риски на ' \
                'относительно низком уровне. \n \n' \
                '**Преимущества:** \n' \
                '\U0001F537 меньшая максимальная просадка в сравнении с SPY \n' \
                '\U0001F537 более высокая долгосрочная доходность в сравнении с SPY \n' \
                '\U0001F537 стабильный рост капитала \n \n' \
                '**Кому подходит Yolo Strategy?** \n' \
                '\U0001F537 если вы инвестор из РФ, но хотите инвестировать в самые успешные компании из США. \n' \
                '\U0001F537 если вы ограничены покупкой акций исключительно, без возможности покупать ETF. \n' \
                '\U0001F537 если вы ориентированы на высокую доходностью и готовы к средним рискам. \n \n' \
                '**Когда покупать Yolo портфель?** \n' \
                '\U0001F537 в любой момент времени, кроме периодов взрывного прироста капитала. ' \
                'В таком случае следует подождать возврата портфеля к средним темпам роста.'


instruction25 = '**Спекулятивный рост**.\n' \
                'Вы готовы принять исключительно высокий риск и допустить значительные колебания ' \
                'портфеля для достижения своих инвестиционных целей. Вас считаете, что максимизация ' \
                'долгосрочной прибыли важнее защиты основной суммы. Подобный портфель может включать ' \
                'спекулятивные позиции, концентрацию на отдельных позициях, низкий уровень диверсификации ' \
                'и позиции в высоко волатильных активах, включая плечевые инструменты и ETF. ' \
                'Подобный уровень риска предполагает доходность существенно выше уровня ' \
                'доходности индекса NASDAQ-100.\n \n' \
                '**Агрессивный рост**.\n' \
                'Вас не волнует уровень колебаний стоимости портфеля. ' \
                'Вы готовы пойти на существенный риск ради достижения своих инвестиционных ' \
                'целей, но вы предпочитаете портфель без высоко волатильных активов и с ' \
                'достаточным уровнем диверсификации. Вас считаете, что максимизация ' \
                'долгосрочной прибыли важнее защиты основной суммы. Подобный уровень ' \
                'риска предполагает доходность выше уровня доходности индекса NASDAQ-100. \n  \n ' \
                '**Умеренный рост**.\n' \
                'Вас не беспокоит волатильность портфеля, однако уровень колебаний не ' \
                'должен превышать уровень волатильности индекса NASDAQ-100. Краткосрочные ' \
                'колебания стоимости портфеля приемлемы, но без масштабных, "кризисных" просадок.  ' \
                'У вас нет острой необходимости в выводе средств из портфеля для обеспечения ' \
                'текущих расходов. Подобный уровень риска предполагает доходность и риски ' \
                'около индекса NASDAQ-100.\n \n' \
                '**Острожный рост**.\n' \
                'Вы готовы принять умеренный риск и у вас нет острой необходимости в ' \
                'выводе средств из портфеля для обеспечения текущих расходов. ' \
                'Вы концентрируетесь на более низких рисках. Подобный уровень ' \
                'риска предполагает доходность и риски сравнимые с широким рынком, индекс SPX.\n \n' \
                '**Сохранение капитала**.\n' \
                'Основная ваша цель — сохранить капитал и доходность выше уровня инфляции. ' \
                'Вы не склонны к краткосрочным потерям и волатильности. ' \
                'Вы принимаете только минимальные колебания стоимости портфеля. ' \
                'Подобный портфель имеет риски существенно ниже, чем широкий рынок, но и ' \
                'доходность не выше уровня широкого рынка, индекс SPX.\n \n' \
                '**Рост и обеспечение текущих расходов**.\n' \
                'Вы стремитесь к высокой доходности за счет прироста стоимости портфеля, ' \
                'но планируете выводить часть средств на систематической основе. ' \
                'Вы признаете и принимаете высокий риск. Подобный уровень риска предполагает ' \
                'доходность выше индекса SPX и до уровня плечевых фондов.\n \n' \

msg_fs = 'Инвестиционный горизонт. \n Чем длиннее временной горизонт инвестирования, ' \
          'тем больше вероятность достижения целей. При длительном горизонте инвестор имеет большую ' \
          'способность принимать риск, потому, что у него есть более длительный период времени для ' \
          'возмещения возможных инвестиционных убытков. '

msg_hr = 'Ожидаемая среднегодовая доходность портфеля  в долгосрочной перспективе (+10 лет) ' \
        'до налогообложения без учета инфляции: '

msg_ret = 'Спасибо! Теперь вы можете снова воспользоваться меню для доступа к портфелям управляющих'

instruction26 = '**О доверительном управлении**. \n \n ' \
                '**Риск-профиль**. \n ' \
                'В соответствии с региональными законами управляющие компании обязаны проводить процедуру ' \
                'риск-профайлинга, то есть определять уровень терпимости к риску. После определения вашей ' \
                'терпимости к риску и присвоения категории можно выбирать инвестиционные продукты и получить ' \
                'инвестиционную информацию ассоциированную с выбранными продуктами. До прохождения риск-профайлинга ' \
                'предоставление инвестиционной информации запрещено. Этот подход практикуется потому, что инвестиции ' \
                'сопряжены с рисками и клиент компании должен иметь представление о своей терпимости к ' \
                'риску и своих целях. \n \n ' \
                'Доступ к статистике инвестиционных продуктов управляющих компаний. ' \
                'Управляющие компании работают через брокеров с разной инфраструктурой, ' \
                'обычно  — это общий корпоративный счет с сегрегацией на субсчета клиентов. ' \
                'Основные брокеры с которыми сотрудничают управляющие компании — это IBKR, Exante, Tradestation. ' \
                'Эти брокеры не предоставляют возможности в автоматическом режиме разделять сделки и позиции ' \
                'клиентов управляющей компании. То есть статистика и состояние портфелей клиентов доступны как ' \
                'сводная статистика по корпоративному счету. Это создает трудности с предоставлением информации ' \
                'для новых клиентов. Клиент может видеть собственные позиции, непосредственно в своем кабинете, ' \
                'на своем счету и может создавать отчеты сам, но управляющая компания этого сделать не может. ' \
                'Компания может аналогичным образом создавать отчеты по своему счету, но такая статистика ' \
                'является смешанной и нерелевантной, потому, что разные клиенты имеют разные портфели с разными ' \
                'просадками и доходностями. Поэтому часто управляющие компании вообще не предоставляют ' \
                'статистику и вся информация об инвестиционных продуктах ограничивается презентациями. ' \
                'Эта ситуация существует из-за ограничений регуляторов, так компания не имеет права ' \
                'предоставлять и формировать отчеты и статистику по счетам клиентов раздельно по портфелям, ' \
                'а предоставление общей статистики по корпоративному счету содержит обезличенные позиции ' \
                'всех клиентов и портфелей сразу. То есть новый клиент не сможет получить представление о ' \
                'нужном ему портфеле.\n ' \
                'В свою очередь, крупные управляющие компании, как правило, создают ETF или взаимные фонды. ' \
                'В таком случае статистика стратегии или портфеля доступна всем в прозрачном виде.\n \n ' \
                '' \
                'Оптимальным решением для увеличения прозрачности и доверия является стороннее ведение ' \
                'статистики портфелей и предоставление клиентам управляющей компании онлайн-доступа к ' \
                'эталоному портфелю. Например, клиент выбирает портфель из доступных в боте. Эти портфели ' \
                'мониторятся независимо от управляющей компании, а компания исполняет идентичную стратегию. ' \
                'В таком случае подобная сторонняя статистика может служить как в мониторинговых так и в ' \
                'маркетинговых целях. Любой заинтересованный клиент, может не просто доверять словам управляющей ' \
                'компании, а просмотреть портфели и стратегии в боте и выбрать подходящее решение. ' \
                'После этого клиент согласует с компанией все детали, подписывает договора и компания ' \
                'управляет активами клиента по общепринятой схеме управляемых счетов. \n \n ' \
                '**Управляемый счет** — это счет на котором компания может управлять активами ' \
                'клиента, но не имеет доступа к выводу и депонированию средств, то есть только рыночные сделки. \n \n ' \
                'Именно поэтому Ипсилон предлагает управляющим компаниям размещать свои портфели. ' \
                'Это увеличивает прозрачность портфелей, так как вся информация доступна в онлайн: история, ' \
                'бектесты, текущая аллокация и изменение капитала стратегии. Клиент прозрачно имеет доступ ' \
                'ко всем этим данным, и может проверить стратегии управляющей компании на соответствии ' \
                'декларируемым доходностям и риску. А так же имея доступ к весовым коэффициентам воссоздать ' \
                'портфель самостоятельно и проверить на соответствии с тем, что есть на управляемом счете.'





