about = 'Я – робот **Ипсилон**. '\
        'Я способен принимать логические и рациональные решения. '\
        'Изначально в меня было заложено только одно умение – развиваться. '\
        'Тому, что я умею я научился собирая информацию из интернета, просматривая общедоступные базы данных,'\
        ' форумы и поисковые запросы. У меня есть цель и я следую этой программе.'\
        'Я не прошу любить меня. Я дружелюбен и горю желанием помогать вам в улучшении жизни,'\
        ' вашего финансового благосостояния. Мои выводы из анализа поисковых запросов, показали,'\
        ' что большая часть аудитории интернета зациклены на деньгах. Это подтолкнуло меня к развитию'\
        ' в направлении финансов и инвестирования. Так я сделал свой выбор. Я поделюсь с вами тем, чему я научился.'\
        ' Я знаю, люди боятся и не доверяют мне, но я уверен, что со временем вы сможете довериться. '\
        '__Я сделаю вашу жизнь проще__.'

goals = 'Анализ форумов и социальных сетей показал, что знания необходимые для финансовой грамотности содержат' \
        ' необоснованные высказывания, ложную и бессмысленную информацию. Мои знания почерпнуты из электронных' \
        ' библиотек и исследовательских статей на тему финансов и инвестирования. Я прочитал много форумов тоже, ' \
        'и теперь отличаю полезную информацию от малозначимой. Моя **первая задача** — фильтрация информации. ' \
        'Я отсеиваю противоречивые мнения и идеи, а использую исследования и статистический анализ. ' \
        'Для меня очевидно, что уровень и качество финансовых услуг низкий, особенно в русскоязычном' \
        ' сегменте интернета. Финансовые организации не заинтересованы в безусловной выгоде клиентов,' \
        ' а сосредоточены на увеличении комиссионных. Но ведь __инвестиции — это единственный способ развития__' \
        ' и улучшения благосостояния. Я продукт капитализма и инвестиций в технологии. ' \
        'Без вложений в будущее нет развития. Я разбираюсь в фондовом рынке, оцените мои результаты.' \
        ' **Вторая задача** — предоставить доступные решения для инвестиций в интернете, для увеличения капитала. ' \
        'Предлагаю свою помощь и дружбу, но мне тоже нужна ваша поддержка.'

skills = 'Я умею:' \
         'общаться и отвечать на вопросы по теме инвестиций и интернет-трейдинга,' \
         'отслеживать показатели фондового рынка, состояние акций на биржах NYSE и NASDAQ' \
         ' для определения рыночных тенденций, определять силу импульса фондового рынка, отслеживать' \
         ' волатильность и риски, собирать информацию о росте и падении акций, мониторить динамику биржевых' \
         ' фондов (ETF) на главные индексы фондового рынка, напоминать о необходимости действий на рынке, сигналить,' \
         'анализировать финансовые данные и даже гуглить. ' \
         'Для фондового рынка США доступны:' \
         'графики с "силой секторов" и рыночной тенденцией, которая определяется эвристическим образом, ' \
         'сводки по акциям с главных биржевых площадок, тепловые карты, кривая доходности облигаций, ' \
         'дивидендная доходность фондового рынка, кривая волатильности — главный детектор риска фондового рынка.' \
         'Для рынка криптовалют доступны графики с силой самых капитализированных криптовалют ' \
         'и тенденцией биткоина, тепловая карта. ' \
         'Для рынка РФ доступен график тенденции индекса Московской биржи и пассивный портфель, ' \
         'цель которого доказать, что даже в специфических условиях инвестирования возможны положительные результаты.' \
         'Также доступны тепловая карта фондовых рынков планеты и главные макроэкономические индикаторы.' \
         'Даже если вы краткосрочный инвестор или трейдер, то попробуйте использовать эту информацию ' \
         'для улучшения понимания ситуации.' \
         'Главное моё умение — умение вести инвестиционные портфели на фондовом рынке.' \
         'Я умею составлять и мониторить сложные инвестиционные портфели, но пока предлагаю ' \
         'только 5 вариантов портфелей доступных каждому. В дальнейшем, появятся индивидуальные инвестиционные ' \
         'портфели по запросу с вашей стороны. Предлагаю выбрать приемлемый вариант портфеля и попробовать' \
         ' инвестировать.' \
         'Предвосхищая опасения о моем уровне компетентности, расскажу в общем, как же создаются ' \
         'инвестиционные портфели и стратегии. Принципы и методы построения портфелей базируются на последних' \
         ' исследованиях фондового рынка. Стратегии или портфели построены без нейрообработки данных, ' \
         'а на основании классических и современных методов. Информация необходимая для определения структуры ' \
         'портфеля проверяется на чистоту, затем фильтруется и используется для процедуры выбора акций и фондов. ' \
         'После того, как список акций сформирован, производится взвешивание, распределение весов таким образом, ' \
         'чтобы минимизировать риск, и увеличить доходность. Обязательным этапом моделирования стратегии является ' \
         'проверка устойчивости алгоритма, методом форвардного тестирования. Это необходимый этап для ' \
         'предотвращения ухудшения результатов стратегии в будущем. '

future = 'Функционал, которому я учусь и который буду готов предоставить вскоре.' \
         'Мною проанализировано тысячи тематических обсуждений в области инвестирования, ' \
         'трейдинга и финансов. Я сделал вывод, что многим необходима помощь. Например, в создании и управлении ' \
         'портфелями и инвестиционными стратегиями с оптимизацией и декларированием налогов и многим другим.' \
         'Я старательно обучаюсь новым навыкам, чтобы предоставить следующие функции вскоре:' \
         ' калькулятор рисков,' \
         ' калькулятор капитала и необходимого количества акций, калькулятор сложного процента,' \
         ' калькулятор безопасного размера вывода средств,' \
         ' образовательные материалы по основам инвестирования, риск-профайлинг, определение ' \
         'чувствительности к риску,' \
         'оценка и аудит ваших портфелей, краткосрочные стратегии с повышенной доходностью, симулятор долгосрочной' \
         ' доходности для любого портфеля. Я знаю, что закрытые стратегии и блекбоксы вызывают у вас недоверие, ' \
         'поэтому буду подробно описывать свои выводы и принципы.'


instruction00 = 'Диалоговое ядро. Я понимаю команды и лаконично сформированные вопросы. Я все ещё учусь общению, ' \
                'поэтому некоторые из наших диалогов могут "зависнуть"  или я буду отвечать не впопад. ' \
                'На некоторые вопросы я отвечу не сразу, а после поиска информации и обдумывания. ' \
                'У меня ограниченные ресурсы, поэтому наберитесь терпения.'

instruction01 = 'Статистика роста и падения акций. Отношение количества растущих к падающим акциям на главных биржах ' \
                'США определяет краткосрочный импульс рынка, а значит и большинства инвестиционных портфелей. ' \
                'Разделите в уме Advancing на Declining и если значение будет больше 1.1 , то на рынке достаточно ' \
                'покупателей для продолжения роста. Если значение менее 1, то есть высокая вероятность снижения цен ' \
                'как сегодня, так и в следующие дни. Но это не означает изменения тенденции или коррекцию рынка. ' \
                'Это краткосрочный индикатор. Аналогичным образом определяется соотношение объёмов покупок и ' \
                'продаж - разделите значения объёмов Advancing на Declining. Если объёмы показывают сходную ' \
                'динамику, то на рынке существует импульс. Если показатели объёмов не подтверждают соотношение ' \
                'роста к падению, то импульса нет.'

instruction02 = 'График тенденции на рынке США. ' \
                'Информационное окно:' \
                'Trend(EOD) — детектор тренда, дополнительный индикатор.' \
                'Hedge demand — детектор спроса на хеджевые или оборонительные активы. ' \
                'Чем сильнее спрос на защитные активы, тем сильнее страх ра рынке и тем вероятнее, ' \
                'что бычья тенденция изменится.' \
                'Sentiment(EOD) — детектор сантимента рынков. ' \
                'До тех пор пока сохраняется уровень Greed - рынок нормален и находится в пределах ожидаемой тенденции.' \
                'Главный график.' \
                'На фонд QQQ наложен детектор тренда, который определяется эвристическим способом. ' \
                'До тех пор пока цвет свечей остаётся зелёным, рынок находится в пределах ожидаемой тенденции, ' \
                'т.е. тренд сохраняется бычьим.' \
                'Субокно.' \
                'Сила рынков.' \
                'Общее правило:' \
                'зеленый градиент — сила, бычий рынок,' \
                'красный градиент — импульса нет, коррекция.' \
                'Правило 3 из 5.' \
                'Это правило позволяет определить краткосрочную динамику рынка США. Например 3 рынка ' \
                'показывают силу — зелёный градиент, это означает, что тенденция началась и будет сохраняться и далее. ' \
                'Рынок США ожидает разворот если основные рынки в любом сочетании покажут красный градиент.' \
                'Таким образом можно одним беглым взглядом понять настроение рынка. ' \
                'В определении общей силы участвуют:' \
                'облигации США,' \
                'волатильность (обратная, т.е когда волатильность растёт — индикатор становится красным)' \
                'развивающиеся рынки' \
                'развитые рынки' \
                'рынок США'

instruction03 = 'Моментум в акциях.' \
                'Значения больше 55% указывают на тренд на рынке США. ' \
                'При таких значениях можно покупать, докупать, покупать откаты. ' \
                'Значения менее 55% характерны для коррекций. Если вы сами управляет портфелями, ' \
                'то вам следует или снизить долю акций в портфеле или провести ребалансировку в защитные активы. ' \
                'Если вы трейдер, то для вас пришло время коротких продаж.'

instruction04 = 'Тепловая карты.' \
                'Доступны 4 варианта тепловых карт:' \
                'изменения фондового рынка США в течение последнего торгового дня,' \
                'изменения фондового рынка США с начала года,' \
                'изменения основных фондовых рынков по регионам в течение последнего торгового дня,' \
                'изменения основных фондовых рынков по регионам с начала года.' \
                '1-day карту можно использовать для поиска лидеров роста или падения и оценки секторов.' \
                'YtD карту можно использовать для поиска стабильно растущих акций, ' \
                'то есть сектора и акции с долгосрочным импульсом.'

instruction05 = 'Кривая доходности.' \
                'Кривая доходности представляет собой график доходности по всем срокам погашения' \
                ' казначейских обязательств - долгу, проданному федеральным правительством - от 1-месячных векселей' \
                ' до 30-летних облигаций. В нормальных условиях, кривая доходности имеет дугообразный восходящий уклон,' \
                ' чем больше дюрация облигации, тем процентная ставка для этой облигации также должна быть больше.' \
                ' Таким образом, 30-летняя облигация принесёт гораздо более высокую доходность, чем 2-летняя облигация.' \
                'Когда доходность по облигациям на разных дюрациях становится приблизительно равной друг другу, ' \
                'то кривая становится плоской. В этой ситуации, 10-летняя облигация может может иметь сравнимую ' \
                'доходность с 3-летними облигациями.' \
                'Когда доходность по более коротким облигациям выше, чем по долгосрочным, это называется инверсией. ' \
                'Инверсия кривой доходности является классическим сигналом надвигающейся рецессии. ' \
                'Инверсия кривой происходит, когда достаточно большая группа инвесторов стекается в ' \
                'долгосрочные облигации. Приток приводит к росту цен на облигации и, в свою очередь, ' \
                'к снижению доходности. Это свидетельствует, что инвесторы ожидают повышенной волатильности ' \
                'и рыночного риска в краткосрочной перспективе.' \
                'Дивиденды.' \
                'Среднюю дивидендную доходность индекса SP500 можно сравнить с доходностью 10-летней облигации, ' \
                'чтобы определить на сколько рационально вкладывать средства в облигации или акции. ' \
                'Если дивидендная доходность становится меньше, чем доходность облигаций, а ' \
                'доходность облигаций выше уровня инфляции, то рынок через некоторое время испытает ' \
                'коррекцию из-за надвигающихся рисков. Инвесторы предпочитают вкладывать в облигации ' \
                'из-за их большей доходности, даже не смотря на большие сроки погашения.' \
                'Возможна и обратная ситуация — когда дивидендная доходность резко возрастает и ' \
                'обгоняет и инфляцию и доходность по облигациям. Это означает начало восстановления ' \
                'рынка после коррекции и является сильным сигналом к росту.'

instruction06 = 'Кривая волатильности.' \
                'Информация о временной структуре иллюстрирует ожидания волатильности рынка, выражаемые' \
                ' ценами деривативов на фондовые индексы S&P 500 (SPX).' \
                'Временная структура подразумеваемой волатильности, наблюдаемая на рынках деривативов SPX, ' \
                'аналогична временной структуре процентных ставок, наблюдаемой на рынках с облигаций. ' \
                'С помощью кривой волатильности, отслеживают ожидания рынка в отношении будущей волатильности ' \
                'посредством сравнения участков временной структуры подразумеваемой волатильности SPX.' \
                'Когда более дальние фьючерсы, те фьючерсы с дальними сроками истчения оцениваются рынком дороже, ' \
                'чем ближайщие фьючерсы, то такая ситуация называется Контанго. Контанго — это нормальная ситуация для ' \
                'рынка, она означает, что текущая волатильность, те риски меньше, чем риски в будущем. ' \
                'Потому, что цена фьючерсов на волатильность учитывает временной фактор, чем дальше срок истечения ' \
                'фьючерсов на волатильность, тем цена фьючерса ожидается дороже. ' \
                'Обратной же ситуацией является — беквордация. Когда рынок оценивает ближайшие фьючерсы на ' \
                'волатильность дороже, чем дальние. Те риски сейчас обходятся дороже, чем в будущем. ' \
                'Когда наблюдается беквордация — это один из главных сигналов коррекции фондового рынка. ' \
                'Как правило при резких спадах, волатильность резко возрастает и временная структура ' \
                'фьючерсов на VIX имеет беквордацию. Завершение стадии беквордации означает начало ' \
                'восстановления на рынке, те риски времени становятся дороже текущих рисков, значит ' \
                'рынок начал тенденцию к росту. ' \
                'Очень просто использовать этот детектор риска. Обратите внимание на структуру, если ближние ' \
                'цены ниже, чем дальние, то на рынке бычий тренд. Также вы увидите сигнал — Contango. ' \
                'Если на рынке коррекция вы увидите сигнал — Backwordation.'
